In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

## DataFrames Section 3

In [2]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [6]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [5]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [10]:
# a multi-index hierarchy
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])
df

             A         B
G1 1  0.475390  1.017812
   2 -0.154169 -1.049164
   3 -0.885276 -0.010292
G2 1 -1.063934 -0.644419
   2  1.005248  0.524315
   3  0.385182 -1.190888

In [11]:
# can use the outside index to grab the entire section
df.loc['G1']

          A         B
1  0.475390  1.017812
2 -0.154169 -1.049164
3 -0.885276 -0.010292

In [13]:
# can branch off of this to select from internal selection
# NOTE: this is a cool distinction loc[number] is row number starting at 1 iloc[number] is starting at 0
df.loc['G1'].loc[1]

A    0.475390
B    1.017812
Name: 1, dtype: float64

In [14]:
# see above
df.loc['G1'].iloc[0]

A    0.475390
B    1.017812
Name: 1, dtype: float64

In [15]:
# right now, the indexes (both outer and inner) don't have names
df.index.names

FrozenList([None, None])

In [18]:
# let's give them names
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.475390  1.017812
       2   -0.154169 -1.049164
       3   -0.885276 -0.010292
G2     1   -1.063934 -0.644419
       2    1.005248  0.524315
       3    0.385182 -1.190888

In [21]:
# to grab a particular number, such as G2,2,B, it's done like this
# select B from df where groups = 'G2' and num = 2
df.loc['G2'].loc[2]['B']

0.5243154589560718

In [22]:
# again you can use loc to pull an entire section
df.loc['G1']

            A         B
Num
1    0.475390  1.017812
2   -0.154169 -1.049164
3   -0.885276 -0.010292

In [23]:
# another "cross section" function can be used to do this as well
df.xs('G1')

            A         B
Num
1    0.475390  1.017812
2   -0.154169 -1.049164
3   -0.885276 -0.010292

In [24]:
# the df.xs function allows selecting from the internal index
# select * from df where num = 2
df.xs(2,level = 'Num')

               A         B
Groups
G1     -0.154169 -1.049164
G2      1.005248  0.524315

## Missing Data

In [25]:
# make a dictionary with missing values
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [26]:
# make a dataframe passing the dictionary into it
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [27]:
# dropna function will drop any rows with null values by default since axis=0 by default
df.dropna()

     A    B  C
0  1.0  5.0  1

In [29]:
# dropna can do this for columns by specifying the axis to be 1
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [30]:
# can use the threshold (thresh) specification to determine how many NaN values to accept before dropping
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [31]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
# can use the fillna to fill with any value where theres NaN
df.fillna('BLIVIT')

        A       B  C
0       1       5  1
1       2  BLIVIT  2
2  BLIVIT  BLIVIT  3

In [34]:
# this is the code for putting the column's mean in 
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [35]:
# this can be done for the entire dataframe
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## Group by

In [36]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [38]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [39]:
# group by company setting variable
byComp = df.groupby('Company')

In [40]:
# applying mean() the above variable
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [41]:
# summing of data
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [47]:
# counting of data
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [42]:
# standard deviation of data
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [45]:
# can pull just one row of value
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [46]:
byComp.sum().xs('FB')

Sales    593
Name: FB, dtype: int64

In [48]:
# this groupby can be done by one line
df.groupby('Company').sum().xs('FB')

Sales    593
Name: FB, dtype: int64

In [50]:
# can use groupby to find the max and min in a table
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [51]:
# can use the describe function to get a lot on information on the dataframe
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [53]:
# you can transpose the output values
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Merging, Joining, Concatenating

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [57]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [58]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [59]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [60]:
# can concatenate dataframes of similar columnar structure
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [61]:
# can concatenate via columns as well
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [5]:
# create example dataframes
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [63]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [64]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [65]:
# here's how you can do a join on two tables
# select l.A, l.B, r.C, r.D from left l, right r where r.key = l.key
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [6]:
# here are more complicated tables to work with
left2 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [67]:
left2

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [68]:
right2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [73]:
pd.merge(left2, right2, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [75]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [77]:
# possible to merge two dataframes with different key names using left_on & right_on parameters
pd.merge(left, right2, left_on='key',right_on='key1')

  key   A   B key1 key2   C   D
0  K0  A0  B0   K0   K0  C0  D0
1  K1  A1  B1   K1   K0  C1  D1
2  K1  A1  B1   K1   K0  C2  D2
3  K2  A2  B2   K2   K0  C3  D3

In [7]:
# possible to use multiple keys in a merge
pd.merge(left2, right2, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

## Joining
Where the keys to join on are in the index instead of being columns

In [8]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [9]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [10]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [11]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [12]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [13]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3